/*
리터럴 연습하기 예제
*/

#include <iostream>

using namespace std;

int main()
{
	//다양한 값 출력하기 

	/*
	cout << 'A' << '\n';
	cout << "C++ 세상에 오신 것을 환영합니다. \n";
	cout << 123 << '\n';
	*/

	//특수문자 출력하기
	/*
	cout << "원화 기호를 표시합니다. :" << '\\' << '\n';
	cout << "작은 따옴표를 표시합니다. :" << '\'' << '\n';
	*/

	//문자코드 출력하기
	/*
	cout << "8진수 문자 코드 101이 가리키는 문자는" << '\101' << "입니다. \n";
	cout << "16진수 문자 코드 61이 가리키는 문자는" << '\x61' << "입니다. \n";
	*/

	//10진수 이외의 표기법으로 표기하기
	/*
	cout << "10진수 10은" << 10 << "입니다. \n";
	cout << "8진수 10은" << 010 << "입니다. \n";
	cout << "16진수 10은" << 0x10 << "입니다. \n";
	cout << "16진수 F는" << 0xF << "입니다. \n";
	*/




	return 0;
}